#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_globalaccelerator_accelerator.example will be created
  + resource "aws_globalaccelerator_accelerator" "example" {
      + dns_name        = (known after apply)
      + enabled         = true
      + hosted_zone_id  = (known after apply)
      + id              = (known after apply)
      + ip_address_type = "IPV4"
      + ip_sets         = (known after apply)
      + name            = "apex-domain-redirect"
    }

  # aws_globalaccelerator_endpoint_group.http will be created
  + resource "aws_globalaccelerator_endpoint_group" "http" {
      + endpoint_group_region         = (known after apply)
      + health_check_interval_seconds = 30
      + health_check_path             = "/"
      + health_check_protocol         = "TCP"
      + id                            = (known after apply)
      + listener_arn                  = (known after apply)
      + threshold_count               = 3
      + traffic_dial_percentage       = 100

      + endpoint_configuration {
          + endpoint_id = (known after apply)
          + weight      = 100
        }
    }

  # aws_globalaccelerator_endpoint_group.https will be created
  + resource "aws_globalaccelerator_endpoint_group" "https" {
      + endpoint_group_region         = (known after apply)
      + health_check_interval_seconds = 30
      + health_check_path             = "/"
      + health_check_protocol         = "TCP"
      + id                            = (known after apply)
      + listener_arn                  = (known after apply)
      + threshold_count               = 3
      + traffic_dial_percentage       = 100

      + endpoint_configuration {
          + endpoint_id = (known after apply)
          + weight      = 100
        }
    }

  # aws_globalaccelerator_listener.http will be created
  + resource "aws_globalaccelerator_listener" "http" {
      + accelerator_arn = (known after apply)
      + client_affinity = "NONE"
      + id              = (known after apply)
      + protocol        = "TCP"

      + port_range {
          + from_port = 80
          + to_port   = 80
        }
    }

  # aws_globalaccelerator_listener.https will be created
  + resource "aws_globalaccelerator_listener" "https" {
      + accelerator_arn = (known after apply)
      + client_affinity = "NONE"
      + id              = (known after apply)
      + protocol        = "TCP"

      + port_range {
          + from_port = 443
          + to_port   = 443
        }
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + vpc_id   = "vpc-0834da06ecf3b075d"
    }

  # aws_lb.example will be created
  + resource "aws_lb" "example" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "test-lb-tf"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id = (known after apply)
          + subnet_id     = (known after apply)
        }
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:eu-west-1:781750785623:certificate/4915d617-0f04-450b-975e-d2ea808a2400"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-FS-2018-06"

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Not found"
              + status_code  = "404"
            }
        }
    }

  # aws_route_table.r will be created
  + resource "aws_route_table" "r" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = (known after apply)
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + nat_gateway_id            = ""
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + vpc_id           = "vpc-0834da06ecf3b075d"
    }

  # aws_route_table_association.routing_public_one will be created
  + resource "aws_route_table_association" "routing_public_one" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.routing_public_two will be created
  + resource "aws_route_table_association" "routing_public_two" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.allow_tls will be created
  + resource "aws_security_group" "allow_tls" {
      + arn                    = (known after apply)
      + description            = "Allow TLS inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "allow_tls"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "vpc-0834da06ecf3b075d"
    }

  # aws_subnet.public_one will be created
  + resource "aws_subnet" "public_one" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + vpc_id                          = "vpc-0834da06ecf3b075d"
    }

  # aws_subnet.public_two will be created
  + resource "aws_subnet" "public_two" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + vpc_id                          = "vpc-0834da06ecf3b075d"
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
